maxgerhardt/micropython/ports/ch32/machine_uart.c
/* machine.UART for the CH32H417.
 *
 * Included by extmod/machine_uart.c via MICROPY_PY_MACHINE_UART_INCLUDEFILE,
 * so the mp_machine_uart_* hooks below keep the static linkage declared there.
 *
 * Both directions are interrupt-driven through ring buffers. Reads take
 * whatever the RX interrupt has already collected, so a byte arriving while
 * Python is busy is kept rather than lost, and writes hand the data to the TX
 * interrupt and return as soon as it fits -- only a full buffer blocks. The
 * console UART in uart.c is deliberately separate and untouched: it is the
 * REPL transport and must keep working even if a script misconfigures a UART.
 *
 * "Remapping" on this part is not the CH32V307/STM32F1 remap-bit scheme. The
 * H417 has an STM32F4-style per-pin alternate-function multiplexer, so any pin
 * the datasheet lists for a signal can carry it, selected with its own AF
 * number -- see machine_uart_pins.h, which is generated from the datasheet
 * rather than typed. That makes every documented pin option available, which
 * is strictly more than a remap bit would give.
 *
 * Two silent failure modes, both already documented in
 * docs/hw/ch32h417-notes.md and both guarded against here: a wrong AF number
 * leaves the USART running with nothing on the wire, and a missing AFIO clock
 * makes the AF writes disappear entirely.
 */

#include "py/mperrno.h"
#include "py/mphal.h"
#include "py/runtime.h"
#include "py/ringbuf.h"
#include "py/stream.h"

#include "ch32h417.h"
#include "irq.h"
#include "machine_pin.h"
#include "machine_uart_pins.h"
#include "uart.h"

#define UART_ID_MIN (1)
#define UART_ID_MAX (8)

#define UART_DEFAULT_RXBUF (256)
#define UART_DEFAULT_TXBUF (256)

// machine.UART.RTS / .CTS, matching every other port's flow constants.
#define UART_FLOW_RTS (1)
#define UART_FLOW_CTS (2)

/* Exposed on the class so flow= reads the same as on every other port. */
#define MICROPY_PY_MACHINE_UART_CLASS_CONSTANTS \
    { MP_ROM_QSTR(MP_QSTR_RTS), MP_ROM_INT(UART_FLOW_RTS) }, \
    { MP_ROM_QSTR(MP_QSTR_CTS), MP_ROM_INT(UART_FLOW_CTS) },

typedef struct _machine_uart_obj_t {
    mp_obj_base_t base;
    USART_TypeDef *usart;
    uint8_t id;
    uint8_t bits;                   // data bits, 5-9, excluding parity
    uint8_t stop_tenths;            // 5, 10, 15 or 20 -- 0.5 to 2 stop bits
    uint8_t flow;
    char parity;                    // 'N', 'O' or 'E'
    uint32_t baudrate;
    uint16_t timeout;               // ms to wait for the first character
    uint16_t timeout_char;          // ms to wait between characters
    const machine_pin_obj_t *tx_pin;
    const machine_pin_obj_t *rx_pin;
    const machine_pin_obj_t *cts_pin;
    const machine_pin_obj_t *rts_pin;
    ringbuf_t rx_ring;
    ringbuf_t tx_ring;
} machine_uart_obj_t;

/* Indexed by id - 1. The interrupt handlers need to reach the object without
 * going through Python, and the buffers must outlive any particular reference,
 * so the live UARTs are rooted here and registered with the GC. */
static machine_uart_obj_t *machine_uart_objs[UART_ID_MAX];
MP_REGISTER_ROOT_POINTER(struct _machine_uart_obj_t * machine_uart_obj_all[8]);

static USART_TypeDef *const machine_uart_regs[UART_ID_MAX] = {
    USART1, USART2, USART3, USART4, USART5, USART6, USART7, USART8,
};

static const IRQn_Type machine_uart_irqn[UART_ID_MAX] = {
    USART1_IRQn, USART2_IRQn, USART3_IRQn, USART4_IRQn,
    USART5_IRQn, USART6_IRQn, USART7_IRQn, USART8_IRQn,
};

static const uint32_t machine_uart_rcc[UART_ID_MAX] = {
    RCC_HB2Periph_USART1, RCC_HB1Periph_USART2, RCC_HB1Periph_USART3,
    RCC_HB1Periph_USART4, RCC_HB1Periph_USART5, RCC_HB1Periph_USART6,
    RCC_HB1Periph_USART7, RCC_HB1Periph_USART8,
};

// USART1 hangs off HB2; the rest off HB1.
static void machine_uart_clock_enable(uint8_t id) {
    if (id == 1) {
        RCC_HB2PeriphClockCmd(machine_uart_rcc[0], ENABLE);
    } else {
        RCC_HB1PeriphClockCmd(machine_uart_rcc[id - 1], ENABLE);
    }
    /* The enable is a read-modify-write, so nothing pushes the store out and
     * the first register access afterwards can be dropped. Same trap as the
     * GPHA clock enable. */
    (void)RCC->HB1PCENR;
}

/* Find the AF number for `pin` on this USART's `sig`, or -1 if the datasheet
 * does not route that signal there. Rejecting the pin is the whole point: a
 * plausible-looking pin with no entry would otherwise be configured as AF0 and
 * fail silently. */
static int machine_uart_pin_af(uint8_t id, uint8_t sig, uint8_t pin_id) {
    for (size_t i = 0; i < MP_ARRAY_SIZE(uart_pin_af_table); i++) {
        const uart_pin_af_t *e = &uart_pin_af_table[i];
        if (e->uart == id && e->sig == sig && e->pin == pin_id) {
            return e->af;
        }
    }
    return -1;
}

static const char *const machine_uart_sig_name[] = { "tx", "rx", "cts", "rts" };

static void machine_uart_config_pin(uint8_t id, uint8_t sig, const machine_pin_obj_t *pin) {
    int af = machine_uart_pin_af(id, sig, pin->id);
    if (af < 0) {
        mp_raise_msg_varg(&mp_type_ValueError,
            MP_ERROR_TEXT("pin cannot be UART%d %s"), id, machine_uart_sig_name[sig]);
    }

    machine_pin_clock_enable(pin->id);
    /* Without the AFIO clock the AF writes below are silently dropped and the
     * pad stays on whatever it was, with no error anywhere. */
    RCC_HB2PeriphClockCmd(RCC_HB2Periph_AFIO, ENABLE);
    (void)RCC->HB2PCENR;

    GPIO_PinAFConfig(machine_pin_gpio(pin->id), MACHINE_PIN_NUM(pin->id), af);

    GPIO_InitTypeDef init = { 0 };
    init.GPIO_Pin = MACHINE_PIN_MASK(pin->id);
    init.GPIO_Speed = GPIO_Speed_High;
    /* RX and CTS are driven by the peripheral or the far end; TX and RTS are
     * driven by us. An input pin left as AF push-pull would fight its driver. */
    init.GPIO_Mode = (sig == UART_SIG_RX || sig == UART_SIG_CTS)
        ? GPIO_Mode_IPU : GPIO_Mode_AF_PP;
    GPIO_Init(machine_pin_gpio(pin->id), &init);
}

/* --- interrupts --- */

static void machine_uart_irq_handler(machine_uart_obj_t *self) {
    USART_TypeDef *u = self->usart;

    /* Read STATR once: reading it and then DATAR is also how the error flags
     * are cleared, so sampling it twice can lose an event. */
    uint32_t statr = u->STATR;

    if (statr & USART_STATR_RXNE) {
        uint8_t c = (uint8_t)(u->DATAR & 0xff);
        /* Drop on overflow rather than blocking in an ISR. A full buffer means
         * the application is not reading; losing the newest byte is the same
         * thing the hardware would do, and keeping the older ones is friendlier
         * to a line-oriented protocol. */
        ringbuf_put(&self->rx_ring, c);
    }

    /* Framing, parity, noise and overrun all latch in STATR and are cleared by
     * the read above followed by a read of DATAR. Without draining DATAR an
     * overrun wedges the receiver: RXNE never sets again. */
    if (statr & (USART_STATR_ORE | USART_STATR_FE | USART_STATR_NE | USART_STATR_PE)) {
        (void)u->DATAR;
    }

