maxgerhardt/micropython/ports/ch32/machine_uart.c
    if ((statr & USART_STATR_TXE) && (u->CTLR1 & USART_CTLR1_TXEIE)) {
        int c = ringbuf_get(&self->tx_ring);
        if (c < 0) {
            /* Nothing left: stop asking. Leaving TXEIE set would re-enter this
             * handler forever, since TXE stays asserted while idle. */
            u->CTLR1 &= ~USART_CTLR1_TXEIE;
        } else {
            u->DATAR = (uint16_t)c;
        }
    }
}

#define MACHINE_UART_IRQ_HANDLER(n)                                  \
    void CH32_IRQ_HANDLER(USART##n##_IRQHandler);                    \
    void USART##n##_IRQHandler(void) {                               \
        machine_uart_obj_t *self = machine_uart_objs[(n) - 1];       \
        if (self != NULL) {                                          \
            machine_uart_irq_handler(self);                          \
        }                                                            \
    }

/* USART1 is the REPL console, driven by uart.c, which owns that vector. */
MACHINE_UART_IRQ_HANDLER(2)
MACHINE_UART_IRQ_HANDLER(3)
MACHINE_UART_IRQ_HANDLER(4)
MACHINE_UART_IRQ_HANDLER(5)
MACHINE_UART_IRQ_HANDLER(6)
MACHINE_UART_IRQ_HANDLER(7)
MACHINE_UART_IRQ_HANDLER(8)

/* --- configuration --- */

static void machine_uart_apply(machine_uart_obj_t *self) {
    USART_TypeDef *u = self->usart;

    USART_InitTypeDef init = { 0 };
    init.USART_BaudRate = self->baudrate;
    /* 9 data bits is really 8 data + 1 parity in the hardware's counting, so a
     * parity-carrying 8-bit frame has to ask for 9. */
    /* The hardware's word length counts the parity bit, so 8E1 is a 9-bit
     * word carrying 8 data bits. MicroPython's `bits` means data bits, which
     * is what a user counts, so the parity bit is added here rather than
     * being the caller's problem. */
    uint32_t total = self->bits + (self->parity != 'N' ? 1 : 0);
    static const uint16_t wordlen[] = {
        USART_WordLength_5b, USART_WordLength_6b, USART_WordLength_7b,
        USART_WordLength_8b, USART_WordLength_9b,
    };
    init.USART_WordLength = wordlen[total - 5];
    init.USART_StopBits =
        self->stop_tenths == 5 ? USART_StopBits_0_5 :
        self->stop_tenths == 15 ? USART_StopBits_1_5 :
        self->stop_tenths == 20 ? USART_StopBits_2 : USART_StopBits_1;
    init.USART_Parity = (self->parity == 'O') ? USART_Parity_Odd
        : (self->parity == 'E') ? USART_Parity_Even : USART_Parity_No;
    init.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
    init.USART_HardwareFlowControl =
        ((self->flow & UART_FLOW_RTS) ? USART_HardwareFlowControl_RTS : 0)
        | ((self->flow & UART_FLOW_CTS) ? USART_HardwareFlowControl_CTS : 0);

    machine_uart_clock_enable(self->id);
    USART_Init(u, &init);

    /* RX interrupt on from the start so bytes are collected whether or not
     * anything is reading yet; TX interrupt only while there is data to send. */
    u->CTLR1 |= USART_CTLR1_RXNEIE;
    USART_Cmd(u, ENABLE);

    NVIC_EnableIRQ(machine_uart_irqn[self->id - 1]);
}

static void mp_machine_uart_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    (void)kind;
    machine_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_printf(print, "UART(%u, baudrate=%u, bits=%u, parity=%s, stop=%.1f",
        self->id, self->baudrate, self->bits,
        self->parity == 'N' ? "None" : (self->parity == 'O' ? "1" : "0"),
        (double)self->stop_tenths / 10);
    if (self->tx_pin) {
        mp_printf(print, ", tx=P%c%u", 'A' + MACHINE_PIN_PORT(self->tx_pin->id),
            MACHINE_PIN_NUM(self->tx_pin->id));
    }
    if (self->rx_pin) {
        mp_printf(print, ", rx=P%c%u", 'A' + MACHINE_PIN_PORT(self->rx_pin->id),
            MACHINE_PIN_NUM(self->rx_pin->id));
    }
    if (self->flow) {
        mp_printf(print, ", flow=%s%s",
            (self->flow & UART_FLOW_RTS) ? "RTS" : "",
            (self->flow & UART_FLOW_CTS) ? ((self->flow & UART_FLOW_RTS) ? "|CTS" : "CTS") : "");
    }
    mp_printf(print, ", timeout=%u, timeout_char=%u, rxbuf=%u, txbuf=%u)",
        self->timeout, self->timeout_char,
        self->rx_ring.size - 1, self->tx_ring.size - 1);
}

enum {
    ARG_baudrate, ARG_bits, ARG_parity, ARG_stop,
    ARG_tx, ARG_rx, ARG_cts, ARG_rts, ARG_flow,
    ARG_timeout, ARG_timeout_char, ARG_rxbuf, ARG_txbuf,
};

static const mp_arg_t machine_uart_allowed_args[] = {
    { MP_QSTR_baudrate,     MP_ARG_INT,  {.u_int = -1} },
    { MP_QSTR_bits,         MP_ARG_INT,  {.u_int = -1} },
    { MP_QSTR_parity,       MP_ARG_OBJ,  {.u_rom_obj = MP_ROM_INT(-1)} },
    /* OBJ rather than INT because 0.5 and 1.5 stop bits are real settings on
     * this USART, and an int parameter could not express them. */
    { MP_QSTR_stop,         MP_ARG_OBJ,  {.u_rom_obj = MP_ROM_INT(-1)} },
    { MP_QSTR_tx,           MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
    { MP_QSTR_rx,           MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
    { MP_QSTR_cts,          MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
    { MP_QSTR_rts,          MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
    { MP_QSTR_flow,         MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
    { MP_QSTR_timeout,      MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
    { MP_QSTR_timeout_char, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
    { MP_QSTR_rxbuf,        MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
    { MP_QSTR_txbuf,        MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
};

static void mp_machine_uart_init_helper(machine_uart_obj_t *self,
    size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {

    mp_arg_val_t args[MP_ARRAY_SIZE(machine_uart_allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args,
        MP_ARRAY_SIZE(machine_uart_allowed_args), machine_uart_allowed_args, args);

    if (args[ARG_baudrate].u_int > 0) {
        self->baudrate = args[ARG_baudrate].u_int;
    }
    uint8_t bits = self->bits;
    if (args[ARG_bits].u_int > 0) {
        if (args[ARG_bits].u_int < 5 || args[ARG_bits].u_int > 9) {
            mp_raise_ValueError(MP_ERROR_TEXT("bits must be 5 to 9"));
        }
        bits = args[ARG_bits].u_int;
    }
    char parity = self->parity;
    if (args[ARG_parity].u_obj != MP_OBJ_NEW_SMALL_INT(-1)) {
        if (args[ARG_parity].u_obj == mp_const_none) {
            parity = 'N';
        } else {
            parity = (mp_obj_get_int(args[ARG_parity].u_obj) & 1) ? 'O' : 'E';
        }
    }

