maxgerhardt/micropython/ports/ch32/machine_uart.c
    /* Data bits plus the parity bit must land on a word length the hardware
     * has. 9 data bits with parity would need a 10-bit word, which it does
     * not, so say so rather than silently dropping the parity. */
    if (bits + (parity != 'N' ? 1 : 0) > 9) {
        mp_raise_ValueError(MP_ERROR_TEXT("bits+parity exceeds a 9-bit word"));
    }
    self->bits = bits;
    self->parity = parity;

    if (args[ARG_stop].u_obj != MP_OBJ_NEW_SMALL_INT(-1)) {
        mp_float_t st = mp_obj_get_float(args[ARG_stop].u_obj);
        int tenths = (int)(st * 10 + (mp_float_t)0.5);
        if (tenths != 5 && tenths != 10 && tenths != 15 && tenths != 20) {
            mp_raise_ValueError(MP_ERROR_TEXT("stop must be 0.5, 1, 1.5 or 2"));
        }
        self->stop_tenths = tenths;
    }
    if (args[ARG_timeout].u_int >= 0) {
        self->timeout = args[ARG_timeout].u_int;
    }
    if (args[ARG_timeout_char].u_int >= 0) {
        self->timeout_char = args[ARG_timeout_char].u_int;
    }
    /* Everything from here is validated into locals before being stored,
     * because UART(id) returns a singleton: raising after a partial update
     * would leave the object carrying settings the caller never successfully
     * asked for, and the *next* construction would then fail for a reason
     * that has nothing to do with its own arguments. */
    uint8_t flow = self->flow;
    if (args[ARG_flow].u_int >= 0) {
        if (args[ARG_flow].u_int & ~(UART_FLOW_RTS | UART_FLOW_CTS)) {
            mp_raise_ValueError(MP_ERROR_TEXT("bad flow"));
        }
        flow = args[ARG_flow].u_int;
    }

    const machine_pin_obj_t *tx = self->tx_pin, *rx = self->rx_pin;
    const machine_pin_obj_t *cts = self->cts_pin, *rts = self->rts_pin;
    if (args[ARG_tx].u_obj != mp_const_none) {
        tx = machine_pin_get(args[ARG_tx].u_obj);
    }
    if (args[ARG_rx].u_obj != mp_const_none) {
        rx = machine_pin_get(args[ARG_rx].u_obj);
    }
    if (args[ARG_cts].u_obj != mp_const_none) {
        cts = machine_pin_get(args[ARG_cts].u_obj);
    }
    if (args[ARG_rts].u_obj != mp_const_none) {
        rts = machine_pin_get(args[ARG_rts].u_obj);
    }

    /* Flow control without the matching pin would look configured and do
     * nothing, which is worse than refusing. */
    if ((flow & UART_FLOW_RTS) && rts == NULL) {
        mp_raise_ValueError(MP_ERROR_TEXT("flow=RTS needs rts="));
    }
    if ((flow & UART_FLOW_CTS) && cts == NULL) {
        mp_raise_ValueError(MP_ERROR_TEXT("flow=CTS needs cts="));
    }

    /* Check every pin against the datasheet table before touching any of
     * them, so a bad third pin cannot leave the first two reconfigured. */
    if (tx && machine_uart_pin_af(self->id, UART_SIG_TX, tx->id) < 0) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("pin cannot be UART%d tx"), self->id);
    }
    if (rx && machine_uart_pin_af(self->id, UART_SIG_RX, rx->id) < 0) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("pin cannot be UART%d rx"), self->id);
    }
    if (cts && machine_uart_pin_af(self->id, UART_SIG_CTS, cts->id) < 0) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("pin cannot be UART%d cts"), self->id);
    }
    if (rts && machine_uart_pin_af(self->id, UART_SIG_RTS, rts->id) < 0) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("pin cannot be UART%d rts"), self->id);
    }

    self->flow = flow;
    self->tx_pin = tx;
    self->rx_pin = rx;
    self->cts_pin = cts;
    self->rts_pin = rts;

    size_t rxbuf = args[ARG_rxbuf].u_int > 0 ? args[ARG_rxbuf].u_int : UART_DEFAULT_RXBUF;
    size_t txbuf = args[ARG_txbuf].u_int > 0 ? args[ARG_txbuf].u_int : UART_DEFAULT_TXBUF;
    if (self->rx_ring.buf == NULL || args[ARG_rxbuf].u_int > 0) {
        ringbuf_alloc(&self->rx_ring, rxbuf + 1);
    }
    if (self->tx_ring.buf == NULL || args[ARG_txbuf].u_int > 0) {
        ringbuf_alloc(&self->tx_ring, txbuf + 1);
    }

    if (self->tx_pin) {
        machine_uart_config_pin(self->id, UART_SIG_TX, self->tx_pin);
    }
    if (self->rx_pin) {
        machine_uart_config_pin(self->id, UART_SIG_RX, self->rx_pin);
    }
    if (self->cts_pin) {
        machine_uart_config_pin(self->id, UART_SIG_CTS, self->cts_pin);
    }
    if (self->rts_pin) {
        machine_uart_config_pin(self->id, UART_SIG_RTS, self->rts_pin);
    }

    /* A timeout_char of 0 makes read(n) give up after the first byte and
     * return one or two, which turns a single read into a churn of calls with
     * interpreter overhead between them -- long enough at 115200 to overrun a
     * small ring and lose most of a burst. Floor it at one character time, 13
     * bits to allow for the start, stop and parity bits, exactly as ports/stm32
     * does. A caller who wants a truly non-blocking read still has any(). */
    uint32_t min_timeout_char = 13000 / self->baudrate + 1;
    if (self->timeout_char < min_timeout_char) {
        self->timeout_char = min_timeout_char;
    }

    machine_uart_apply(self);
}

static mp_obj_t mp_machine_uart_make_new(const mp_obj_type_t *type,
    size_t n_args, size_t n_kw, const mp_obj_t *args) {

    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);
    mp_int_t id = mp_obj_get_int(args[0]);
    if (id < UART_ID_MIN || id > UART_ID_MAX) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("UART(%d) does not exist"), (int)id);
    }
    if (id == 1) {
        /* USART1 carries the REPL. Handing it to a script would take the
         * console away mid-session, with no way to report what happened. */
        mp_raise_ValueError(MP_ERROR_TEXT("UART(1) is the REPL console"));
    }

    machine_uart_obj_t *self = machine_uart_objs[id - 1];
    if (self == NULL) {
        self = mp_obj_malloc(machine_uart_obj_t, type);
        self->id = id;
        self->usart = machine_uart_regs[id - 1];
        self->baudrate = 9600;
        self->bits = 8;
        self->parity = 'N';
        self->stop_tenths = 10;
        self->flow = 0;
        self->timeout = 0;
        self->timeout_char = 0;
        self->tx_pin = self->rx_pin = self->cts_pin = self->rts_pin = NULL;
        self->rx_ring.buf = NULL;
        self->tx_ring.buf = NULL;
        machine_uart_objs[id - 1] = self;
        MP_STATE_PORT(machine_uart_obj_all)[id - 1] = self;
    }
    self->base.type = type;

    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
    mp_machine_uart_init_helper(self, n_args - 1, args + 1, &kw_args);
    return MP_OBJ_FROM_PTR(self);
}

static void mp_machine_uart_deinit(machine_uart_obj_t *self) {
    NVIC_DisableIRQ(machine_uart_irqn[self->id - 1]);
    USART_Cmd(self->usart, DISABLE);
    self->usart->CTLR1 &= ~(USART_CTLR1_RXNEIE | USART_CTLR1_TXEIE);
    machine_uart_objs[self->id - 1] = NULL;
    MP_STATE_PORT(machine_uart_obj_all)[self->id - 1] = NULL;
}

/* Every UART is torn down before the heap goes, or an interrupt arriving after
 * a soft reset would push a byte into a ring buffer that no longer exists. */
void machine_uart_deinit_all(void) {
    for (int i = 0; i < UART_ID_MAX; i++) {
        if (machine_uart_objs[i] != NULL) {
            mp_machine_uart_deinit(machine_uart_objs[i]);
        }
    }
}

static mp_int_t mp_machine_uart_any(machine_uart_obj_t *self) {
    return ringbuf_avail(&self->rx_ring);
}

static bool mp_machine_uart_txdone(machine_uart_obj_t *self) {
    return ringbuf_avail(&self->tx_ring) == 0 && (self->usart->STATR & USART_STATR_TC);
}

