maxgerhardt/micropython/ports/ch32/machine_uart.c
static void mp_machine_uart_sendbreak(machine_uart_obj_t *self) {
    self->usart->CTLR1 |= USART_CTLR1_SBK;
}

static mp_uint_t mp_machine_uart_read(mp_obj_t self_in, void *buf_in, mp_uint_t size, int *errcode) {
    machine_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);
    uint8_t *dest = buf_in;

    /* The first byte gets `timeout`, each later one `timeout_char`. Waiting is
     * done with mp_event_wait_ms() so the scheduler and USB keep running and
     * Ctrl-C still works. */
    for (size_t got = 0; got < size;) {
        mp_uint_t deadline = mp_hal_ticks_ms() + (got == 0 ? self->timeout : self->timeout_char);
        int c;
        while ((c = ringbuf_get(&self->rx_ring)) < 0) {
            if ((mp_int_t)(mp_hal_ticks_ms() - deadline) >= 0) {
                if (got == 0) {
                    *errcode = MP_EAGAIN;
                    return MP_STREAM_ERROR;
                }
                return got;
            }
            mp_event_wait_ms(1);
        }
        dest[got++] = (uint8_t)c;
    }
    return size;
}

static mp_uint_t mp_machine_uart_write(mp_obj_t self_in, const void *buf_in, mp_uint_t size, int *errcode) {
    machine_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);
    const uint8_t *src = buf_in;

    for (size_t sent = 0; sent < size;) {
        if (ringbuf_put(&self->tx_ring, src[sent]) < 0) {
            /* Buffer full: let the interrupt drain some and try again. This is
             * the only case that blocks, and it is bounded by the line rate. */
            self->usart->CTLR1 |= USART_CTLR1_TXEIE;
            mp_uint_t deadline = mp_hal_ticks_ms() + (self->timeout ? self->timeout : 1000);
            while (ringbuf_free(&self->tx_ring) == 0) {
                if ((mp_int_t)(mp_hal_ticks_ms() - deadline) >= 0) {
                    if (sent == 0) {
                        *errcode = MP_EAGAIN;
                        return MP_STREAM_ERROR;
                    }
                    return sent;
                }
                mp_event_wait_ms(1);
            }
            continue;
        }
        sent++;
    }

    /* Kick the transmitter last: enabling TXEIE earlier would let the handler
     * race ahead of the bytes still being queued. */
    self->usart->CTLR1 |= USART_CTLR1_TXEIE;
    return size;
}

static mp_int_t mp_machine_uart_readchar(machine_uart_obj_t *self) {
    return ringbuf_get(&self->rx_ring);
}

static void mp_machine_uart_writechar(machine_uart_obj_t *self, uint16_t data) {
    ringbuf_put(&self->tx_ring, (uint8_t)data);
    self->usart->CTLR1 |= USART_CTLR1_TXEIE;
}

static mp_uint_t mp_machine_uart_ioctl(mp_obj_t self_in, mp_uint_t request, uintptr_t arg, int *errcode) {
    machine_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);
    switch (request) {
        case MP_STREAM_POLL: {
            mp_uint_t ret = 0;
            if ((arg & MP_STREAM_POLL_RD) && ringbuf_avail(&self->rx_ring) > 0) {
                ret |= MP_STREAM_POLL_RD;
            }
            if ((arg & MP_STREAM_POLL_WR) && ringbuf_free(&self->tx_ring) > 0) {
                ret |= MP_STREAM_POLL_WR;
            }
            return ret;
        }
        case MP_STREAM_FLUSH: {
            mp_uint_t deadline = mp_hal_ticks_ms() + 1000;
            while (!mp_machine_uart_txdone(self)) {
                if ((mp_int_t)(mp_hal_ticks_ms() - deadline) >= 0) {
                    *errcode = MP_ETIMEDOUT;
                    return MP_STREAM_ERROR;
                }
                mp_event_wait_ms(1);
            }
            return 0;
        }
        default:
            *errcode = MP_EINVAL;
            return MP_STREAM_ERROR;
    }
}
